In [65]:
import pandas as pd
import pymysql
pymysql.install_as_MySQLdb()
from sqlalchemy import create_engine
from sqlalchemy_utils import create_database, database_exists

tmdb_data = pd.read_csv("Data/tmdb_results_combined.csv.gz", low_memory = False)
clean_basics = pd.read_csv("Data/clean_basics.csv.gz", low_memory = False)
clean_ratings = pd.read_csv("Data/clean_ratings.csv.gz", low_memory = False)
#akas = pd.read_csv("Data/title_akas.csv.gz", low_memory = False)

In [66]:
tmdb_data.head()

,imdb_id,adult,backdrop_path,belongs_to_collection,budget,genres,homepage,id,original_language,original_title,...,revenue,runtime,spoken_languages,status,tagline,title,video,vote_average,vote_count,certification
0,0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,tt0113026,0.0,/vMFs7nw6P0bIV1jDsQpxAieAVnH.jpg,NaN,10000000.0,"[{'id': 35, 'name': 'Comedy'}, {'id': 10402, '...",NaN,62127.0,en,The Fantasticks,...,0.0,86.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,Try to remember the first time magic happened,The Fantasticks,0.0,5.5,22.0,NaN
2,tt0113092,0.0,NaN,NaN,0.0,"[{'id': 878, 'name': 'Science Fiction'}]",NaN,110977.0,en,For the Cause,...,0.0,100.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,The ultimate showdown on a forbidden planet.,For the Cause,0.0,5.1,8.0,NaN
3,tt0116391,0.0,NaN,NaN,0.0,"[{'id': 18, 'name': 'Drama'}, {'id': 28, 'name...",NaN,442869.0,hi,Gang,...,0.0,152.0,"[{'english_name': 'Hindi', 'iso_639_1': 'hi', ...",Released,NaN,Gang,0.0,0.0,0.0,NaN
4,tt0116748,0.0,NaN,NaN,0.0,"[{'id': 18, 'name': 'Drama'}, {'id': 10749, 'n...",NaN,579396.0,hi,Karobaar,...,0.0,180.0,"[{'english_name': 'Hindi', 'iso_639_1': 'hi', ...",Released,The Business of Love,Karobaar,0.0,5.5,2.0,NaN

In [67]:
tmdb_data = tmdb_data[['imdb_id', 'revenue', 'budget', 'certification']]
tmdb_data

        imdb_id  revenue      budget certification
0             0      NaN         NaN           NaN
1     tt0113026      0.0  10000000.0           NaN
2     tt0113092      0.0         0.0           NaN
3     tt0116391      0.0         0.0           NaN
4     tt0116748      0.0         0.0           NaN
...         ...      ...         ...           ...
4434  tt8795764      0.0         0.0            NR
4435  tt8929248      0.0         0.0           NaN
4436  tt9071078      0.0         0.0           NaN
4437  tt9099724      0.0         0.0           NaN
4438  tt9798698      0.0         0.0           NaN

[4439 rows x 4 columns]

In [68]:
clean_ratings.head()

      tconst  averageRating  numVotes
0  tt0000001            5.7      1905
1  tt0000002            5.8       256
2  tt0000003            6.5      1704
3  tt0000004            5.6       168
4  tt0000005            6.2      2519

In [69]:
clean_basics.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El Tango del Viudo y Su Espejo Deformante,0,2020,NaN,70,Drama
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,NaN,122,Drama
3,tt0079644,movie,November 1828,November 1828,0,2001,NaN,140,"Drama,War"
4,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005,NaN,100,"Comedy,Horror,Sci-Fi"

In [70]:
clean_basics['genres_split'] = clean_basics['genres'].str.split(',')
clean_basics

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance","[Comedy, Fantasy, Romance]"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El Tango del Viudo y Su Espejo Deformante,0,2020,NaN,70,Drama,[Drama]
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,NaN,122,Drama,[Drama]
3,tt0079644,movie,November 1828,November 1828,0,2001,NaN,140,"Drama,War","[Drama, War]"
4,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005,NaN,100,"Comedy,Horror,Sci-Fi","[Comedy, Horror, Sci-Fi]"
...,...,...,...,...,...,...,...,...,...,...
141951,tt9916170,movie,The Rehearsal,O Ensaio,0,2019,NaN,51,Drama,[Drama]
141952,tt9916190,movie,Safeguard,Safeguard,0,2020,NaN,95,"Action,Adventure,Thriller","[Action, Adventure, Thriller]"
141953,tt9916270,movie,Il talento del calabrone,Il talento del calabrone,0,2020,NaN,84,Thriller,[Thriller]
141954,tt9916362,movie,Coven,Akelarre,0,2020,NaN,92,"Drama,History","[Drama, History]"
141955,tt9916538,movie,Kuambil Lagi Hatiku,Kuambil Lagi Hatiku,0,2019,NaN,123,Drama,[Drama]

In [71]:
exploded_genres = clean_basics.explode('genres_split')
exploded_genres


#genres_split = basics['genres'].str.split(",")

#unique_genres = genres_split.explode().unique()
#unique_genres

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance",Comedy
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance",Fantasy
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance",Romance
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El Tango del Viudo y Su Espejo Deformante,0,2020,NaN,70,Drama,Drama
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,NaN,122,Drama,Drama
...,...,...,...,...,...,...,...,...,...,...
141952,tt9916190,movie,Safeguard,Safeguard,0,2020,NaN,95,"Action,Adventure,Thriller",Thriller
141953,tt9916270,movie,Il talento del calabrone,Il talento del calabrone,0,2020,NaN,84,Thriller,Thriller
141954,tt9916362,movie,Coven,Akelarre,0,2020,NaN,92,"Drama,History",Drama
141954,tt9916362,movie,Coven,Akelarre,0,2020,NaN,92,"Drama,History",History
141955,tt9916538,movie,Kuambil Lagi Hatiku,Kuambil Lagi Hatiku,0,2019,NaN,123,Drama,Drama

In [72]:
unique_genres = sorted(exploded_genres['genres_split'].dropna().unique())

In [73]:
title_genres = exploded_genres[['tconst', 'genres_split']].copy()
title_genres.head()

      tconst genres_split
0  tt0035423       Comedy
0  tt0035423      Fantasy
0  tt0035423      Romance
1  tt0062336        Drama
2  tt0069049        Drama

In [74]:
## Making the genre mapper dictionary
genre_ints = range(len(unique_genres))
genre_map = dict(zip(unique_genres, genre_ints))
genre_map

{'Action': 0,
 'Adult': 1,
 'Adventure': 2,
 'Animation': 3,
 'Biography': 4,
 'Comedy': 5,
 'Crime': 6,
 'Drama': 7,
 'Family': 8,
 'Fantasy': 9,
 'Game-Show': 10,
 'History': 11,
 'Horror': 12,
 'Music': 13,
 'Musical': 14,
 'Mystery': 15,
 'News': 16,
 'Reality-TV': 17,
 'Romance': 18,
 'Sci-Fi': 19,
 'Short': 20,
 'Sport': 21,
 'Talk-Show': 22,
 'Thriller': 23,
 'War': 24,
 'Western': 25}

In [75]:
title_genres['genres_id'] = title_genres['genres_split'].map(genre_map)
title_genres = title_genres.drop(columns = 'genres_split')
title_genres

           tconst  genres_id
0       tt0035423          5
0       tt0035423          9
0       tt0035423         18
1       tt0062336          7
2       tt0069049          7
...           ...        ...
141952  tt9916190         23
141953  tt9916270         23
141954  tt9916362          7
141954  tt9916362         11
141955  tt9916538          7

[246178 rows x 2 columns]

In [76]:
genres = pd.DataFrame({'Genre_Name': genre_map.keys(),
                             'Genre_ID':genre_map.values()})
genres.head()

  Genre_Name  Genre_ID
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

In [77]:
clean_basics = clean_basics.drop(columns = ['originalTitle', 'isAdult', 'titleType', 'genres', 'genres_split'], axis = 1)
clean_basics.head()

,tconst,primaryTitle,startYear,endYear,runtimeMinutes
0,tt0035423,Kate & Leopold,2001,NaN,118
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020,NaN,70
2,tt0069049,The Other Side of the Wind,2018,NaN,122
3,tt0079644,November 1828,2001,NaN,140
4,tt0088751,The Naked Monster,2005,NaN,100

In [78]:
connection = "mysql+pymysql://root:root@localhost/project"
engine = create_engine(connection)
engine

Engine(mysql+pymysql://root:***@localhost/project)

In [79]:
from sqlalchemy.types import *

key_len = clean_basics['tconst'].fillna('').map(len).max()
title_len = clean_basics['primaryTitle'].fillna('').map(len).max()
## Create a schema dictonary using Sqlalchemy datatype objects
df_schema_1 = {
    "tconst": String(key_len+1), 
    "primaryTitle": Text(title_len+1),
    'startYear':Float(),
    'endYear':Float(),
    'runtimeMinutes':Integer()}

In [80]:
clean_basics.to_sql('title_basics',engine,dtype=df_schema_1,if_exists='replace',index=False)

141956

In [94]:
engine.execute('ALTER TABLE title_basics ADD PRIMARY KEY (`tconst`);')

In [99]:
sql = """SELECT *
FROM title_basics
LIMIT 5;"""

pd.read_sql_query(sql, engine)

,tconst,primaryTitle,startYear,endYear,runtimeMinutes
0,tt0035423,Kate & Leopold,2001.0,None,118
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020.0,None,70
2,tt0069049,The Other Side of the Wind,2018.0,None,122
3,tt0079644,November 1828,2001.0,None,140
4,tt0088751,The Naked Monster,2005.0,None,100

In [81]:
tmdb_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4439 entries, 0 to 4438
Data columns (total 4 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   imdb_id        4439 non-null   object
 1   revenue        4437 non-null   float64
 2   budget         4437 non-null   float64
 3   certification  816 non-null    object
dtypes: float64(2), object(2)
memory usage: 138.8+ KB

In [82]:
key_len = tmdb_data['imdb_id'].fillna('').map(len).max()
title_len = tmdb_data['certification'].fillna('').map(len).max()
## Create a schema dictonary using Sqlalchemy datatype objects
df_schema_2 = {
    "imdb_id": String(key_len+1), 
    "certification": Text(title_len+1),
    'revenue':Float(),
    'budget':Float()}

In [83]:
tmdb_data.to_sql('tmdb_data',engine,dtype=df_schema_2,if_exists='replace',index=False)

4439

In [100]:
sql = """SELECT *
FROM tmdb_data
LIMIT 5;"""

pd.read_sql_query(sql, engine)

     imdb_id  revenue      budget certification
0          0      NaN         NaN          None
1  tt0113026      0.0  10000000.0          None
2  tt0113092      0.0         0.0          None
3  tt0116391      0.0         0.0          None
4  tt0116748      0.0         0.0          None

In [84]:
clean_ratings.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1256195 entries, 0 to 1256194
Data columns (total 3 columns):
 #   Column         Non-Null Count    Dtype
---  ------         --------------    -----
 0   tconst         1256195 non-null  object
 1   averageRating  1256195 non-null  float64
 2   numVotes       1256195 non-null  int64
dtypes: float64(1), int64(1), object(1)
memory usage: 28.8+ MB

In [85]:
key_len = clean_basics['tconst'].fillna('').map(len).max()
## Create a schema dictonary using Sqlalchemy datatype objects
df_schema_3 = {
    "tconst": String(key_len+1), 
    'averageRating':Float(),
    'numVotes':Integer()}

In [86]:
clean_ratings.to_sql('title_ratings',engine,dtype=df_schema_3,if_exists='replace',index=False)

1256195

In [102]:
sql = """SELECT *
FROM title_ratings
LIMIT 5;"""

pd.read_sql_query(sql, engine)

      tconst  averageRating  numVotes
0  tt0000001            5.7      1905
1  tt0000002            5.8       256
2  tt0000003            6.5      1704
3  tt0000004            5.6       168
4  tt0000005            6.2      2519

In [87]:
genres.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 26 entries, 0 to 25
Data columns (total 2 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Genre_Name  26 non-null     object
 1   Genre_ID    26 non-null     int64
dtypes: int64(1), object(1)
memory usage: 544.0+ bytes

In [90]:
key_len = genres['Genre_Name'].fillna('').map(len).max()
## Create a schema dictonary using Sqlalchemy datatype objects
df_schema_4 = {
    "imdb_id": String(key_len+1), 
    "Genre_ID": Integer()}

In [91]:
genres.to_sql('genres',engine,dtype=df_schema_4,if_exists='replace',index=False)

26

In [103]:
sql = """SELECT *
FROM genres
LIMIT 5;"""

pd.read_sql_query(sql, engine)

  Genre_Name  Genre_ID
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

In [88]:
title_genres.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 246178 entries, 0 to 141955
Data columns (total 2 columns):
 #   Column     Non-Null Count   Dtype
---  ------     --------------   -----
 0   tconst     246178 non-null  object
 1   genres_id  246178 non-null  int64
dtypes: int64(1), object(1)
memory usage: 5.6+ MB

In [92]:
key_len = title_genres['tconst'].fillna('').map(len).max()
## Create a schema dictonary using Sqlalchemy datatype objects
df_schema_5 = {
    "tconst": String(key_len+1), 
    "genres_id": Integer()}

In [93]:
title_genres.to_sql('title_genres',engine,dtype=df_schema_5,if_exists='replace',index=False)

246178

In [104]:
sql = """SELECT *
FROM title_genres
LIMIT 5;"""

pd.read_sql_query(sql, engine)

      tconst  genres_id
0  tt0035423          5
1  tt0035423          9
2  tt0035423         18
3  tt0062336          7
4  tt0069049          7

In [105]:
sql = """SHOW TABLES"""
pd.read_sql_query(sql, engine)

  Tables_in_project
0            genres
1      title_basics
2      title_genres
3     title_ratings
4         tmdb_data